In [5]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine("mysql+mysqlconnector://root:Mysql%40123@127.0.0.1:3306/etl_practice")
# Read data from a table
df = pd.read_sql("SELECT * FROM employees", engine)
df.head()

   emp_id    name  department_id   salary
0       1  Anjali             10  50000.0
1       2  Bharat             10  60000.0
2       3  Chetan             20  40000.0
3       4   Divya             20  55000.0
4       5    Esha             30  72000.0

In [4]:
from sqlalchemy import create_engine
import pandas as pd

# Replace with your actual credentials and service name
engine = create_engine("oracle+oracledb://system:Oracle%40123@127.0.0.1:1521/?service_name=XE")
df = pd.read_sql("SELECT * FROM EMPLOYEE", engine)
df.head()

  empid     name  salary
0  E001    Alice    4000
1  E002      Bob   12000
2  E003  Charlie    6000
3  E004    David    9500
4  E005      Eva    3000